z-mnp-test/misc/ClhWsNPCWebServiceDr/NPCWebServiceSoap12Binding/processNPCMsg/MIW_OM_1012_INT.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.clearinghouse.com">
   <soap:Header/>
   <soap:Body>
      <ws:processNPCMsg>
         <ws:userId>mnpCatTest</ws:userId>
         <ws:password>bW5wQ2xoVGVzdDIwMTE=</ws:password>
         <ws:xmlMsg><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?><NPCMessageData>
    <NPCData>
        <MessageHeader>
            <PortType>1</PortType>
            <MessageID>1012</MessageID>
            <SoapRequestId>206</SoapRequestId>
            <MessageCreateTimeStamp>20161025181700</MessageCreateTimeStamp>
            <Sender>CRDBINT</Sender>
            <Receiver>CAT3G</Receiver>
        </MessageHeader>
        <NPCMessages>
			<PortNotificationException>
					<ProcessType>1</ProcessType>
					<OrderId>031702161512895</OrderId>
					<MSISDN>0887666683</MSISDN>
					<PortId>20171011150019AWN9147</PortId>
					<PortingDate>20171024053000</PortingDate>
			</PortNotificationException>
        </NPCMessages>
        <MessageFooter>
            <Checksum>1</Checksum>
        </MessageFooter>
    </NPCData>
</NPCMessageData>
         ]]></ws:xmlMsg>
      </ws:processNPCMsg>
   </soap:Body>
</soap:Envelope>